@extends('layouts.print')

@section('content')
<div id="wrapper">
		
	<!--Start Content-->
	<div class="row">
		<div class="col-lg-12">
			<div class="panel panel-default">
				<div class="panel-body">
					<h3>ใบรับซ่อมสินค้า</h3>
					<p>
					บริษัท เคเอสเอส อินเตอร์เทค กรุ๊ป จำกัด
					</br>เลขที่ 99 หมู่ 8 ถ.พหลโยธิน ต.คูคต อ.ลำลูกกา จ.ปทุมธานี 12130
					</br>โทรศัพท์ 081-914-9736, 02-992-6888 ต่อ  7761, โทรสาร 02-992-7275
					</p>
					<div class="table-responsive">
						<table class="table table-bordered table-striped">
							<thead>
								<tr>
									<th>ชื่อลูกค้า</th>
									<th>เบอร์โทรศัพท์</th>
									<th>วันที่ส่งซ่อม</th>
									<th>Service Code</th>
								</tr>
							</thead>
							<tbody>
								<td>{{ $claim->customer->first_name . ' ' . $claim->customer->last_name }}</td>
								<td>{{ $claim->customer->phone }}</td>
								<td>{{ $claim->created_at }}</td>
								<td>{{ $claim->claim_code }}</td>
							</tbody>
						</table>
						<table class="table table-bordered table-striped">
							<thead>
								<tr>
									<th class="text-center" style="width: 50px;">ลำดับ</th>
									<th>ชื่อสินค้า/โมเดล</th>
									<th>อาการเสีย</th>
									<th>ลักษณะพิเศษ</th>
									<th>สิ่งที่นำมาด้วย</th>
									<th>ซีเรียลนัมเบอร์</th>
								</tr>
							</thead>
							<tbody>
							@foreach ($claimProductAll as $claimProduct)
							<tr>
								<td>{{ $loop->index + 1 }}</td>
								<td>{{ $claimProduct->product->name }}</td>
								<td>{{ $claimProduct->claim_detail }}</td>
								<td>{{ $claimProduct->specific_detail }}</td>
								<td>{{ $claimProduct->package_bundle }}</td>
								<td>{{ $claimProduct->serial_number }}</td>
							</tr>
							@endforeach

							</tbody>
						</table>
					</div>

				<table>
					</thead>
							<tr>
								<th width=20%>ผู้ส่งซ่อม..........................</th>
								<th width=20%>ผู้รับซ่อม..........................</th>
								<th width=20%>ผู้ส่งซ่อม..........................</th>
								<th width=20%>ผู้รับซ่อม..........................</th>
							</tr>
					</thead>
					<tbody>
						<tr>
							<td>(............./............./.............)</td>
							<td>(............./............./.............)</td>
							<td>(............./............./.............)</td>
							<td>(............./............./.............)</td>
						</tr>
					</tbody>
				</table>
				<p></p>			
				<p><strong>เงื่อนไขในการรับประกันสินค้า ของ บริษัท เคเอสเอส อินเตอร์เทค กรุ๊ป จำกัด  มีดังต่อไปนี้ </strong></p>
				<p>1.สินค้าที่นำมาเคลมจะต้องมีกล่องมาพร้อมสินค้า และสติ๊กเกอร์รับประกันสินค้าของทางเคเอสเอส อินเตอร์เทค กรุ๊ป เท่านั้น</p>
				<p>2.สินค้าจะต้องอยู่ในสภาพเดิม หากมีความเสียหายที่เกิดจากการ แตก หัก บุบ ยุบ หัก งอ สายขาด และมี คราบน้ำ ไฟไหม้ ไฟตก ไฟเกิน ฟ้าผ่า หรือเกิดจากการใช้งานที่ไม่ถูกต้อง</br>
				ทำให้สินค้าได้รับความเสียหายทางบริษัทจะไม่ทำการรับเคลมสินค้าทุกกรณี</p>
				<p>3.หากไม่มีเอกสารในการรับคืนสินค้า ทางลูกค้าต้องนำบัตรประชาชน เพื่อแสดงสิทธิ์ในการรับคืนสินค้าและไม่สามารถรับคืนสินค้าดังกล่าวได้ ไม่ว่าในกรณีใดๆทั้งสิ้น</p>
				<p>4.ทางห้างขอสงวนสิทธิ์ในการรับคืนสินค้า ทุกชนิด เว้นเสียจากว่าสินค้าตัวนั้นจะใช้งานไม่ได้แล้วลูกค้าต้องการเปลี่ยนเป็น สินค้าที่ราคาสูงกว่าไป</p>
				<p>5.ติดต่อรับสินค้าภายใน 60 วัน นับจากวันที่รับแจ้งจากทาง เคเอสเอส อินเตอร์เทค กรุ๊ป</br>
				หากเกินระยะเวลาที่บริษัทกำหนดข้างต้นทางบริษัทจะถือว่าลูกค้าไม่ประสงค์รับคืนสินค้าดังกล่าว และยินยอมให้สินค้าเป็นกรรมสิทธิ์ของทางบริษัทโดยลูกค้าจะไม่เรียกร้องค่าเสียหายใดๆ หรือดำเนินคดีกับทางบริษัท เคเอสเอส อินเตอร์เทค กรุ๊ป ไม่ว่าจะเป็นทางเพ่ง หรือทางอาญาก็ตาม</p>
				</div>
			</div>
		</div>
		<!-- /.col-lg-12 -->
	</div>
	<!--End Content-->
</div>
@endsection